{
    "title": "Banana Chocolate Chip Cake, with Muscovado Meringue Buttercream",
    "description": "Lightly perfumed with banana and studded with milk chocolate chips, this is my favourite banana sponge recipe. I know you’re ideally meant to use bananas that are so ripe they’re almost black, but I often don’t have the patience to wait, so use whatever bananas you have handy (as long as they are actually yellow, not green). The caramel notes from the muscovado meringue buttercream works excellently here, however this sponge is moist enough to warrant not making any. The quantity below will also fit a 2lb loaf tin excellently. ",
    "date": "2019-01-30",
    "slug": "banana-layer-cake",
    "serves": 10,
    "prepTime": 45,
    "cookingTime": 30,
    "ingredients": [
        {
            "name": "sponge",
            "ingredients": [
                "210g plain flour",
                "230g light brown sugar",
                "110g vegetable/sunflower oil",
                "2 eggs",
                "1 tsp baking soda",
                "1/4 tsp ground cinnamon",
                "1/2 tsp fine salt",
                "3-4 bananas, peeled and mashed (about 300-320 grams mashed bananas)",
                "2 tablespoons sour cream",
                "1 teaspoon vanilla extract",
                "100g milk chocolate chips"
            ]
        },
        {
            "name": "muscovado meringue buttercream",
            "ingredients": [
                "6 egg whites",
                "400g light brown muscovado sugar",
                "1/2 tsp fine salt",
                "450g unsalted butter",
                "1 tbsp vanilla"
            ]
        }
    ],
    "method": [
        "For the sponge: preheat the oven to 180c/160c fan/gas mark 4. Lightly oil and line 3 6inch cake tins with baking paper.",
        "Place the flour, baking soda, cinnamon and salt in a bowl, set to one side.",
        "With a stand mixer fitted with the whip attachment, beat together the sugar and eggs on medium speed until light and pale, around 5 minutes.",
        "Switch to a low speed then slowly add the oil.",
        "Add the bananas, sour cream, and vanilla, and continue to mix on low speed just until combined.",
        "Fold in the flour mixture until thoroughly combined.",
        "Pour the batter into the cake tins. Bake in the oven for about 30 minutes, the cake should be golden and spongy to the touch.",
        "Let cool in the pan for 10 minutes, then remove and let cool completely on a wire rack.",
        "For the meringue buttercream: place egg whites and sugar into the bowl of a stand mixer, whisk until combined.",
        "Place the bowl over a pot with of simmering water (ensuring the bottom of the bowl does not touch the water), and whisk constantly until the mixture is hot and no longer grainy to the touch (it should feel warm and will read 160F on a candy thermometer).",
        "Place the bowl back on your stand mixer and whisk on med-high until the meringue is stiff and cooled (the bowl is no longer warm to the touch (approx. 5-10mins)).",
        "Switch to paddle attachment (or continue using the whisk). Slowly add cubed butter and mix until smooth.",
        "Stir through the salt and vanilla.",
        "For icing and layering a cake, I find this video extremely useful - https://www.youtube.com/watch?v=llSIoYri8b4."
    ],
    "tags": [
        "sweet"
    ]
}