{
  "title": "Carrot, Orange and Vanilla Bean Cake with White Chocolate Meringue Buttercream",
  "description": "I'd advise using good quality white chocolate in the icing here, my preferred brand is Green and Blacks because it tastes delicious and also has flecks of vanilla in it. This is a big cake with lots of ingredients, so it's best made for a large event. Saying that, the sponge (and icing) keeps extremely well, so it should be fine to eat even after a few days.",
  "date": "2019-02-22",
  "slug": "carrot-layer-cake",
  "serves": 9,
  "prepTime": 30,
  "cookingTime": 30,
  "ingredients": [
    {
      "name": "sponge",
      "ingredients": [
        "450g soft light brown sugar",
        "5 eggs",
        "400g sunflower oil",
        "450g plain flour",
        "1.5 tsp bicarbonate of soda",
        "1.5 tsp baking powder",
        "1.5 tsp ground cinnamon",
        "1 tsp tsp ground ginger",
        "3/4 tsp fine salt",
        "1 tsp vanilla extract",
        "500g carrots",
        "1 orange",
        "100g white chocolate"
      ]
    },
    {
      "name": "white chocolate meringue buttercream",
      "ingredients": [
        "12 large egg whites",
        "800g caster sugar",
        "900g unsalted butter",
        "400g white chocolate chopped",
        "2 vanilla pods, scraped",
        "Pinch of salt"
      ]
    }
  ],
  "method": [
    "For the sponge, preheat the oven to 180c/160c fan/gas mark 4. Grease and line 3 8 inch tins with baking paper.",
    "Grate the carrots, zest the orange and chop the white chocolate into small chunks for the cake.",
    "Put the sugar, eggs, orange zest and oil in a bowl of stand mixer. Beat until all the ingredients are well incorporated (don’t worry if the mixture looks slightly split).",
    "Slowly add the flour, bicarbonate of soda, baking powder, cinnamon, ginger, salt and vanilla extract and continue to beat until well mixed.",
    "Stir in the grated carrots and white chocolate by hand until they are all evenly dispersed.",
    "Pour the mixture into the prepared cake tins and smooth over with a palette knife. Bake in the preheated oven for 20–25 minutes, or until golden brown and the sponge bounces back when touched. Leave the cakes to cool for about ten minutes in the tins before turning out onto a wire cooling rack to cool completely.",
    "For the buttercream, you want butter that is slightly hard - i.e. not completely soft, but not straight from the fridge.",
    "Melt white chocolate and set to one side to let cool (but not harden).",
    "Place egg whites and sugar into the bowl of a stand mixer, whisk until combined.",
    "Place bowl over a double boiler on the stove and whisk constantly until the mixture is hot and no longer grainy to the touch, it should reach 70C on a thermometer.",
    "Scrape the seeds out of the vanilla pods.",
    "Place the bowl on your stand mixer and whisk on med-high until the meringue is stiff and cooled (the bowl is no longer warm to the touch, about 5-10mins.",
    "Switch to the paddle attachment. Slowly add cubed butter and mix until smooth.",
    "Add the white chocolate, vanilla seeds, pinch of salt and whip until smooth.",
    "For icing and layering a cake, I find this video extremely useful - https://www.youtube.com/watch?v=llSIoYri8b4."
  ],
  "tags": [
    "sweet"
  ],
  "views": 6
}