{
  "title": "Chicken Katsu Burger",
  "description": "This meal is extremely quick to make and surprisingly light and fresh in flavour; thanks in large part to the fresh herbs, chinese cabbage and lime juice. Surprisingly or not, Japanese curry sauce is thought to have been introduced by the British during the Meijia period, when Japan’s feudal society became increasingly westernised. This dish is also delicious with white rice replacing the brioche buns, although I do urge you to prioritise making the katsu burger.",
  "date": "2019-02-12",
  "slug": "chicken-katsu-burger",
  "serves": 4,
  "prepTime": 15,
  "cookingTime": 15,
  "ingredients": [
    {
      "ingredients": [
        "4 boneless skinless chicken thighs",
        "4 brioche buns",
        "100g plain flour",
        "1 tbsp curry powder",
        "100g panko breadcrumbs",
        "2 eggs",
        "Salt"
      ]
    },
    {
      "name": "coleslaw",
      "ingredients": [
        "230g chinese cabbage (about 1/2 of one cabbage)",
        "20g coriander",
        "3 spring onions",
        "2 tbsp sesame oil",
        "2 tbsp lime juice (about 1 lime)"
      ]
    },
    {
      "name": "katsu mayonnaise",
      "ingredients": [
        "120g mayonnaise",
        "1 tbsp + 1 tsp curry powder",
        "1/2 tsp soy sauce",
        "1 tbsp golden syrup (or runny honey)"
      ]
    }
  ],
  "method": [
    "Firstly, start by making the coleslaw. Finely shred the cabbage, chop the coriander, and slice the spring onions. Mix in a bowl with the 2 tbsp sesame oil and 2 tbsp lime juice. Set aside until later.",
    "Now prepare the katsu mayonnaise. Mix all the ingredients (i.e. 120g mayonnaise, 1 tbsp + 1 tsp curry powder, 1/2 tsp soy sauce and 1 tbsp golden syrup / honey) in a small bowl.",
    "Position three large shallow bowls or Tupperwares on your work surface. Place the flour, 1 tbsp curry powder and a generous pinch of salt in one bowl. Then whisk the eggs into the second bowl. Finally add the breadcrumbs to the last bowl.",
    "Heat a large frying pan with generous amount of oil over a medium-high heat. You want enough oil in the pan so it is about 1/4 of an inch deep.",
    "Meanwhile, flatten out the chicken thighs on a chopping board. Dip in flour so it coats the chicken fully, then dip in the egg, followed by the bread crumbs.",
    "When the oil is hot (it should give off a good sizzle when you add the chicken), add the chicken and cook for about 3 minutes on each side. Cook until the breadcrumbs are golden and the chicken is piping hot, no longer pink and the juices running clear.",
    "Whilst the chicken is cooking, toast the brioche buns. Prepare a plate lined with kitchen paper to drain the chicken when it comes out of the pan.",
    "Spoon the katsu mayonnaise onto the bottom of the bun, place the chicken on top, scatter over the coleslaw (and a little more mayonnaise if you fancy), and place the bun on top. Serve immediately."
  ],
  "tags": [
    "savoury"
  ],
  "views": 12
}