{
  "title": "Roasted Vegetables with Harissa Yoghurt and Marinated Feta",
  "description": "The vegetable quantities here aren’t particularly important, what you do want are two large trays that are filled with a mixture of colourful vegetables. If it seems like a hassle to buy multiple types of vegetables, then you could of course decrease the variety and increase the quantity. A simple mixture of sweet potato, red onions and mushroom would be delicious.",
  "date": "2018-09-23",
  "slug": "roastedveg-harissa",
  "serves": 2,
  "prepTime": 10,
  "cookingTime": 30,
  "ingredients": [
    "6 tbsp vegetable/sunflower oil",
    "1/2 aubergine, diced",
    "1 red onion, sliced",
    "1/2 sweet potato, diced",
    "1 red pepper, diced ",
    "1/2 courgette, diced",
    "8 chestnut mushrooms, cut in half",
    "4 tbsp natural or greek yoghurt",
    "2-4 tbsp harissa",
    "80g feta",
    "3 tbsp olive oil",
    "4 sprigs thyme, leaves picked and stalks discarded",
    "1/2 tbsp za'atar",
    "120g pearl barley (dry weight)"
  ],
  "method": [
    "Preheat the oven to 200c/180c fan/gas mark 6.",
    "Cook the pearl barley according to packet instructions. Alternatively, a can of chickpeas or butterbeans would also be delicious. ",
    "Start by preparing the vegetables to roast. It’s entirely up to you what size to cut the vegetables in, although try and cut the vegetables in fairly similar sizes so they cook more evenly (although they’ll never cook perfectly in unison since different vegetables roast at different times). I like to cut the veg in a 1inch dice, and to slice the mushrooms in half.",
    "Prepare two large baking trays by putting 2 tbsp of vegetable/sunflower oil in each one. Tip in the chopped vegetables (try and avoid overcrowding the pan, as this will make the veg steam and go mushy - rather than golden and crisp). Then sprinkle over another tbsp of oil on top of the vegetables. Sprinkle liberally with salt. ",
    "Place in the preheated oven for 25-35 minutes. Check halfway through, stir and swap the trays around if necessary.",
    "Meanwhile, make the marinated feta by placing 80g feta, 3 tbsp olive oil, 1/2 tbsp za'atar and 4 sprigs of thyme leaves (stalks discarded) in a shallow bowl.",
    "Plate up by adding a portion of pearl barley (or your choice of carbohydrate) to each plate, add the roasted vegetables on top, scatter the marinated feta over, then spoon a couple of tbsp of yoghurt onto each plate, with the harissa on top of the yoghurt. "
  ],
  "tags": ["savoury"]
}
