{
  "title": "Rye Sticky Toffee Cake",
  "description": "This cake delivers all the qualities of a sticky toffee pudding, but only uses a single pan and is extremely quick to make. The rye flour here gives a subtle nuttiness and welcome acidity to the cake, however you can use any flour you want (plain flour is delicious as always, but spelt or even quinoa flour would be very nice too). It’s excellent served warm, and reheats very well, but it’s equally good cold. If you do choose to serve it warm ensure you buy some vanilla ice-cream, and you will not be disappointed.",
  "date": "2018-09-23",
  "slug": "rye-stickytoffee",
  "serves": 9,
  "prepTime": 15,
  "cookingTime": 30,
  "ingredients": [
    {
      "name": "sponge",
      "ingredients": [
        "175g chopped dates",
        "1 tsp bicarb",
        "250ml boiling water",
        "75g unsalted butter, diced",
        "175g dark muscadvado sugar",
        "1 egg",
        "175g rye flour",
        "1 tsp baking powder"
      ]
    },
    {
      "name": "sauce",
      "ingredients": [
        "100g unsalted butter",
        "150g dark brown sugar",
        "100ml double cream"
      ]
    }
  ],
  "method": [
    "Preheat the oven to 180c/160c fan/gas mark 4. Grease an 8 inch square cake tin, or a 9 inch circular cake tin with butter, then line with baking paper.",
    "In a medium saucepan over a medium heat, place the chopped dates, bicarb and boiling water. Heat for about 5-10 minutes, until the dates have completely softened.",
    "Remove the pan from the heat and add the butter. Stir gently until melted.",
    "Stir in the sugar, egg, baking powder and flour.",
    "Pour the mixture into the prepared tin, place the cake on a baking sheet (there’s chance of spillage in the oven later on), and bake on the middle shelf of the oven for 15 minutes.",
    "Meanwhile, for the sauce, rinse out the saucepan and place the ingredients (butter, dark brown sugar, double cream) in it. Set the pan over a medium heat, then stir and allow the sugar to melt. Increase the heat and allow the sauce to bubble for 5 minutes, then remove the pan from the heat.",
    "After 15 minutes, remove the cake from the oven and pour the sauce over the sponge. Return the cake to the oven for another 15 minutes, until a skewer inserted into the centre comes out fairly clean (a few moist crumbs are fine).",
    "Allow the cake to cool in the tin for 45 minutes (this will let the sauce sink further into the cake). Remove from the tin and serve hot, warm or cold. It goes excellently with vanilla ice cream (or custard)."
  ],
  "tags": [
    "sweet"
  ],
  "views": 49
}