{
  "title": "Spiced Chicken and Pearl Barley Soup",
  "description": "This is one of this meals you want to eat when in need of something nourishing and hot. I like to make it for two people then freeze the rest in tupperware for when you’re in need of a virtuous meal. Swap the cooked pearl barley for orzo, faro or giant cous cous. You could even add a drained can of chickpeas or butterbeans instead, just add them in at the end (after step 4) and heat through for an extra 5-10 minutes.",
  "date": "2018-09-23",
  "slug": "spicedchicken-barley",
  "serves": 4,
  "prepTime": 10,
  "cookingTime": 45,
  "ingredients": [
    {
      "ingredients": [
        "1kg chicken drumsticks",
        "2 celery sticks, sliced",
        "1 onion, sliced",
        "2 garlic cloves, chopped",
        "4-6 carrots (about 500g), peeled and batoned",
        "1 tbsp cumin",
        "1/2 tbsp turmeric",
        "1 tsp cinnamon",
        "1/2 tbsp smoked paprika",
        "1 tbsp tomato puree",
        "250g potato, chopped",
        "2 chicken stock cubes",
        "150g cooked pearl barley (or faro, giant cous cous, orzo - or even a can of butterbeans/chickpeas would be delicious and healthy)"
      ]
    }
  ],
  "method": [
    "Heat a large pan with 1-2 tbsp of olive oil over a high heat. When the pan is hot, add 2 sliced celery sticks, 1 sliced onion and a pinch of salt then sweat for 15 minutes, until softened. Stir often.",
    "Add the spices (1 tbsp cumin, 1/2 tbsp turmeric, 1 tsp cinnamon, 1/2 tbsp smoked paprika), 2 cloves of chopped garlic and 1 tbsp of tomato puree. Cook for two minutes, stirring frequently.",
    "Add the chicken drumsticks, the chopped potato, batoned carrots, the chicken stock cubes and enough water to cover all the ingredients. Bring to the boil, then reduce the heat to a simmer and cook for 45 minutes (or until then chicken is cooked through).",
    "At this point I like to remove the drumsticks and half of the carrots then whizz up the rest of the soup so it has a slightly thicker mouthfeel. However, if you like a more stock like soup with chunks of veg, then don’t bother to puree the soup!",
    "Stir through the cooked pearl barley and serve. Some chopped coriander, harissa, a spoonful of yoghurt or some toasted seeds are all excellent toppings, but not necessary at all."
  ],
  "tags": [
    "savoury"
  ],
  "views": 59
}